-- ------------------------------
-- 10-1. consultations 추가
-- ------------------------------
INSERT IGNORE INTO consultations (employee_id, manager_id, scheduled_date, scheduled_turn, reason, content, status, consultated_at, created_at)
VALUES
(2, 3, '2026-09-17', 'T2', '허리 통증 상담', '장시간 근무로 인한 허리 통증 관리 방법을 알고 싶습니다.', 'RESERVED', NULL, '2026-08-16 00:00:00'),
(21, 2, '2026-09-12', 'T1', '스트레스 관리 상담', '업무 스트레스와 수면 패턴에 대한 상담을 원합니다.', 'RESERVED', NULL, '2026-08-24 00:00:00'),
(16, 2, '2026-09-14', 'T4', '스트레스 관리 상담', '업무 스트레스와 수면 패턴에 대한 상담을 원합니다.', 'FINISHED', '2026-09-14 16:00:00', '2026-08-25 00:00:00'),
(9, 3, '2026-08-23', 'T3', '스트레스 관리 상담', '업무 스트레스와 수면 패턴에 대한 상담을 원합니다.', 'RESERVED', NULL, '2026-08-27 00:00:00'),
(10, 2, '2026-09-14', 'T3', '스트레스 관리 상담', '업무 스트레스와 수면 패턴에 대한 상담을 원합니다.', 'FINISHED', '2026-09-14 16:00:00', '2026-08-10 00:00:00'),
(27, 2, '2026-09-02', 'T3', '체중 관리 상담', '체중 증가로 인한 건강 관리 방안을 상담하고 싶습니다.', 'RESERVED', NULL, '2026-08-26 00:00:00'),
(29, 3, '2026-09-01', 'T2', '수면 장애 상담', '불규칙한 수면 패턴으로 인한 피로 누적 상담입니다.', 'CANCELED', NULL, '2026-08-09 00:00:00'),
(24, 2, '2026-09-18', 'T2', '금연 상담', '금연 프로그램 참여 관련 상담을 요청합니다.', 'FINISHED', '2026-09-18 16:00:00', '2026-08-09 00:00:00'),
(20, 2, '2026-08-23', 'T1', '수면 장애 상담', '불규칙한 수면 패턴으로 인한 피로 누적 상담입니다.', 'CANCELED', NULL, '2026-08-19 00:00:00'),
(3, 2, '2026-09-19', 'T3', '심리 상담', '업무 관련 정서적 어려움에 대한 상담을 원합니다.', 'CANCELED', NULL, '2026-08-24 00:00:00'),
(7, 3, '2026-08-21', 'T3', '수면 장애 상담', '불규칙한 수면 패턴으로 인한 피로 누적 상담입니다.', 'RESERVED', NULL, '2026-08-24 00:00:00'),
(24, 3, '2026-08-22', 'T1', '심리 상담', '업무 관련 정서적 어려움에 대한 상담을 원합니다.', 'CANCELED', NULL, '2026-08-10 00:00:00'),
(23, 3, '2026-08-12', 'T3', '혈압 관리 상담', '최근 혈압이 높아져 생활습관 점검이 필요합니다.', 'RESERVED', NULL, '2026-08-09 00:00:00'),
(5, 3, '2026-08-28', 'T1', '수면 장애 상담', '불규칙한 수면 패턴으로 인한 피로 누적 상담입니다.', 'RESERVED', NULL, '2026-08-30 00:00:00'),
(26, 3, '2026-09-07', 'T2', '금연 상담', '금연 프로그램 참여 관련 상담을 요청합니다.', 'FINISHED', '2026-09-07 15:00:00', '2026-08-20 00:00:00'),
(26, 2, '2026-09-11', 'T2', '혈압 관리 상담', '최근 혈압이 높아져 생활습관 점검이 필요합니다.', 'FINISHED', '2026-09-11 14:00:00', '2026-08-30 00:00:00'),
(20, 2, '2026-09-01', 'T3', '스트레스 관리 상담', '업무 스트레스와 수면 패턴에 대한 상담을 원합니다.', 'RESERVED', NULL, '2026-08-21 00:00:00'),
(11, 3, '2026-08-22', 'T1', '허리 통증 상담', '장시간 근무로 인한 허리 통증 관리 방법을 알고 싶습니다.', 'RESERVED', NULL, '2026-08-21 00:00:00'),
(32, 2, '2026-09-08', 'T2', '허리 통증 상담', '장시간 근무로 인한 허리 통증 관리 방법을 알고 싶습니다.', 'FINISHED', '2026-09-08 14:00:00', '2026-08-30 00:00:00'),
(7, 3, '2026-08-25', 'T2', '금연 상담', '금연 프로그램 참여 관련 상담을 요청합니다.', 'CANCELED', NULL, '2026-08-14 00:00:00');

